<?xml version="1.0"?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="1,3,720,1280" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>1280</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="1252" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 4" offset="0" size="16" />
			<output>
				<port id="0" precision="FP32" names="1252">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="3032" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="16" size="8" />
			<output>
				<port id="0" precision="I64" names="3032" />
			</output>
		</layer>
		<layer id="3" name="Constant_28881" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="24" size="4" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Divide_7339" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Gather_28880" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="28" size="3456" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Reshape_877" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3484" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2796">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Clip_9" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="374">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="2800" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 1, 1" offset="3612" size="4096" />
			<output>
				<port id="0" precision="FP32" names="2800">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv_10/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Reshape_894" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="7708" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_10" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2799">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Clip_13" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="379">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Reshape_907" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="7836" size="1152" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv_14/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_959" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="8988" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_14" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2802">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Clip_17" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="384">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="2806" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="9116" size="2048" />
			<output>
				<port id="0" precision="FP32" names="2806">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_18/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Reshape_976" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="11164" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_18" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2805">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="2809" type="Const" version="opset1">
			<data element_type="f32" shape="96, 16, 1, 1" offset="11228" size="6144" />
			<output>
				<port id="0" precision="FP32" names="2809">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_19/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Reshape_991" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="17372" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_19" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2808">
					<dim>1</dim>
					<dim>96</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Clip_22" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="391">
					<dim>1</dim>
					<dim>96</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_1004" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="17756" size="3456" />
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_23/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>360</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Reshape_1056" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="21212" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv_23" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2811">
					<dim>1</dim>
					<dim>96</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Clip_26" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="396">
					<dim>1</dim>
					<dim>96</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="2815" type="Const" version="opset1">
			<data element_type="f32" shape="24, 96, 1, 1" offset="21596" size="9216" />
			<output>
				<port id="0" precision="FP32" names="2815">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_27/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Reshape_1073" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="30812" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_27" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2814">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="2818" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="30908" size="13824" />
			<output>
				<port id="0" precision="FP32" names="2818">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_28/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_1088" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="44732" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_28" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2817">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Clip_31" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="403">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Reshape_1101" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="45308" size="5184" />
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_32/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Reshape_1153" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="50492" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_32" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2820">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Clip_35" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="408">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="2824" type="Const" version="opset1">
			<data element_type="f32" shape="24, 144, 1, 1" offset="51068" size="13824" />
			<output>
				<port id="0" precision="FP32" names="2824">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_36/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Reshape_1170" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="64892" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_36" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2823">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Add_37" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="411">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="2827" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="64988" size="13824" />
			<output>
				<port id="0" precision="FP32" names="2827">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_38/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Reshape_1186" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="78812" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_38" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2826">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Clip_41" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="416">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Reshape_1199" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="79388" size="5184" />
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_42/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>180</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_1251" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="84572" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_42" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2829">
					<dim>1</dim>
					<dim>144</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Clip_45" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="421">
					<dim>1</dim>
					<dim>144</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="2833" type="Const" version="opset1">
			<data element_type="f32" shape="32, 144, 1, 1" offset="85148" size="18432" />
			<output>
				<port id="0" precision="FP32" names="2833">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_46/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Reshape_1268" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="103580" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_46" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2832">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="2836" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="103708" size="24576" />
			<output>
				<port id="0" precision="FP32" names="2836">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_47/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Reshape_1283" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="128284" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_47" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2835">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Clip_50" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="428">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Reshape_1296" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="129052" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_51/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_1348" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="135964" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_51" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2838">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Clip_54" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="433">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="2842" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="136732" size="24576" />
			<output>
				<port id="0" precision="FP32" names="2842">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_55/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Reshape_1365" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="161308" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_55" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2841">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Add_56" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="436">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="2845" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="161436" size="24576" />
			<output>
				<port id="0" precision="FP32" names="2845">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv_57/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Reshape_1381" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="186012" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_57" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2844">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Clip_60" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="441">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_1394" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="186780" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Conv_61/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Reshape_1446" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="193692" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_61" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2847">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Clip_64" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="446">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="2851" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="194460" size="24576" />
			<output>
				<port id="0" precision="FP32" names="2851">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Conv_65/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Reshape_1463" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="219036" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_65" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2850">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Add_66" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="449">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="neck.lateral_convs.0.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 1, 1" offset="219164" size="8192" />
			<output>
				<port id="0" precision="FP32" names="neck.lateral_convs.0.conv.weight">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_173/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Reshape_2553" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="227356" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_173" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="589">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="2854" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="227612" size="24576" />
			<output>
				<port id="0" precision="FP32" names="2854">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_67/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Reshape_1479" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="252188" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv_67" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2853">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Clip_70" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="454">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Reshape_1492" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="252956" size="6912" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_71/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Reshape_1544" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="259868" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_71" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2856">
					<dim>1</dim>
					<dim>192</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Clip_74" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="459">
					<dim>1</dim>
					<dim>192</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="2860" type="Const" version="opset1">
			<data element_type="f32" shape="64, 192, 1, 1" offset="260636" size="49152" />
			<output>
				<port id="0" precision="FP32" names="2860">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_75/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Reshape_1561" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="309788" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
